Revit 2024 API
ParameterTypeId.RbsServiceTypeParam Property
 "Building Service"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RbsServiceTypeParam { get; }
Visual Basic
Public Shared ReadOnly Property RbsServiceTypeParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RbsServiceTypeParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace